docs/zeromq.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-03 Fri 05:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ZIO ZeroMQ notes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">ZIO ZeroMQ notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf20b4d3">1. cppzmq errors</a></li>
<li><a href="#org6b6a5c9">2. ROUTER/DEALER Multipart Messages</a></li>
</ul>
</div>
</div>
<div class="nav">
<ul class="org-ul">
<li><a href="index.html">Main Page</a></li>
<li><a href="install.html">Installation</a></li>
<li><a href="tutorial.html">Tutorials</a></li>
<li><a href="examples.html">Examples</a></li>
<li><a href="whytos.html">Design documents</a></li>
<li><a href="api.html">API Reference</a></li>
</ul>

</div>

<p>
This document holds some special notes on the underlying ZeroMQ ecosystem
</p>

<div id="outline-container-orgf20b4d3" class="outline-2">
<h2 id="orgf20b4d3"><span class="section-number-2">1</span> cppzmq errors</h2>
<div class="outline-text-2" id="text-1">
<p>
The core <code>zmq::socket_t::recv()</code> and <code>send()</code> calls follow an error
handling protocol which consists of possibly thrown <code>zmq::error_t</code>
exception or a null return value which may not be discarded.  The
return value is a <code>std::optional</code> which will hold a size value if
successful and will be null if low-level <code>libzmq</code> call raises <code>EAGAIN</code>
(ie, a signal interrupted the call).  All other low-level errors cause
<code>zmq::error_t</code> to be raised.
</p>

<p>
ZIO's <code>zio/util.hpp</code> provides high level, type-erased versions of <code>send()</code>
and <code>recv()</code>.  They provide default flags of <code>none</code> and so the 
</p>

<p>
These pass-through cppzmq's <code>send_result_t</code> or
<code>recv_result_t</code> which will be empty if a timeout was allowed to occur.
As the <code>send_flags</code> or <code>recv_flags</code> value of <code>noflags</code> is default, this
return value is no marked with C++17 <code>nodiscard</code>.  If caller requests
<code>nowait</code> or otherwise set the socket option it is up to caller to check
the return.  Note, unrelated to cppzmq error handling, the most
generic of these high-level functions will throw <code>std::runtime_error</code> if
given an unsupported socket type.
</p>
</div>
</div>

<div id="outline-container-org6b6a5c9" class="outline-2">
<h2 id="org6b6a5c9"><span class="section-number-2">2</span> ROUTER/DEALER Multipart Messages</h2>
<div class="outline-text-2" id="text-2">
<p>
Of particular confusion is how ROUTER and DEALER deal with "address
envelope stacks".  These are identifiers prefixed, in-band to the
multipart message.  The synchronous REP/REQ sockets also and or remove
an initial null message.  Both of these manipulations done inside the
ZeroMQ socket code may be exposed to user code depending on which
socket types are employed.
</p>

<p>
The following table summarizes what each socket does internally inside
their <code>send()</code> or <code>recv()</code> method.  See the <code>zmq_socket(3)</code> man page and
Zguide for details.  In the table an "addr" is a single frame holding
an (opaque) identifier and "null" is an empty delimiter frame.  In the
headline row, a "(s)" indicates the socket is of a "serverish" type
and "(c)" indicates a "clientish" type.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">inside</th>
<th scope="col" class="org-left">ROUTER(s)</th>
<th scope="col" class="org-left">DEALER(c)</th>
<th scope="col" class="org-left">REP(s)</th>
<th scope="col" class="org-left">REQ(c)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>send()</code></td>
<td class="org-left">pop(addr)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">push(null)</td>
<td class="org-left">push(null)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>recv()</code></td>
<td class="org-left">push(addr)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">pop(null)</td>
<td class="org-left">pop(null)</td>
</tr>
</tbody>
</table>

<p>
 To understand any message path through two endpoint sockets start with
the <code>send()</code> row and mentally apply the operation for the given sending
socket.  Then move to the <code>recv()</code> row and apply the operation in the
given receiving socket.
</p>

<p>
For example, a REQ-&gt;ROUTER exchange starts with a "push(null)" in the
REQ's <code>send()</code> , the message is then transferred, and ends with a
"push(addr)" performed inside the ROUTER's <code>recv()</code>.  The resulting
message delivered to the ROUTER appication has at least 2 parts in
addition to any payload parts:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">addr</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">null</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">payload</td>
</tr>
</tbody>
</table>

<p>
When the ROUTER application wishes to return a message to the client,
it must assure the "addr" and "null" frames are kept intact.  And,
depending on any intervening proxies, themselves composed of ROUTER,
there may be multiple "addr" (thus address envelope <b>stack</b>).
</p>

<p>
Of important note is that an application using DEALER must explicitly
manipulate the multipart message in order to correctly talk to ROUTER
or REP.  A DEALER application will receive a message from REP or
ROUTER that starts with a "null" frame and likewise it must add a null
frame when sending to either.
</p>
</div>
</div>
</div>
</body>
</html>
